stm32-hotspot/STM32WBA55_BLE_HeartRate_Client/STM32_WPAN/App/gatt_client_app.c
static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

static void HR_Body_Sensor_Location_read_char(void)
{
  uint8_t index = 0;
  tBleStatus ret;
  
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    if (a_ClientContext[index].state != GATT_CLIENT_APP_IDLE)
    {
      ret = aci_gatt_read_char_value(a_ClientContext[index].connHdl, 
                                     a_ClientContext[index].SensorLocationValueHdl);
      
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gatt_read_char_value failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].SensorLocationValueHdl);
      }
      else
      {
        LOG_INFO_APP("aci_gatt_read_char_value success, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].SensorLocationValueHdl);
      }
    }
  }
  
  return;
}

static void HR_Control_Point_write_char(void)
{
  uint8_t index = 0;
  tBleStatus ret;

  if (HRButtonData.write == 0x00)
  {
    HRButtonData.write = 0x01;
  }
  else
  {
    HRButtonData.write = 0x00;
  }

  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    if (a_ClientContext[index].state != GATT_CLIENT_APP_IDLE)
    {
      ret = aci_gatt_write_without_resp(a_ClientContext[index].connHdl,
                                        a_ClientContext[index].ControlPointValueHdl,
                                        2,
                                        (uint8_t *)&HRButtonData);

      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gatt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].ControlPointValueHdl);
      }
      else
      {
        LOG_INFO_APP("aci_gatt_write_without_resp success, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].ControlPointValueHdl);
        
        LOG_INFO_APP("  Outgoing Write sent Heart Rate Control Point information\n");
        LOG_INFO_APP("  HEART RATE APPLICATION CLIENT : WRITE - %02X\n", HRButtonData.write);
      }
    }
  }

  return;
}

static void HR_Measurement_toggle_notification(void)
{
  uint8_t index = 0;
  tBleStatus ret = 0;
  
  if (HRButtonData.notify == 0x0000)
  {
    HRButtonData.notify = 0x0001;
  }
  else
  {
    HRButtonData.notify = 0x0000;
  }
  
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    if (a_ClientContext[index].state != GATT_CLIENT_APP_IDLE)
    {
      if(a_ClientContext[index].HeartRateMeasurementDescHdl != 0x0000)
      {
        ret = aci_gatt_write_char_desc(a_ClientContext[index].connHdl,
                                          a_ClientContext[index].HeartRateMeasurementDescHdl,
                                          2,
                                          (uint8_t *) &HRButtonData.notify);
        gatt_cmd_resp_wait();
      }

      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gatt_write_char_desc failed, connHdl=0x%04X, DescHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].HeartRateMeasurementDescHdl);
      }
      else
      {
        LOG_INFO_APP("aci_gatt_write_char_desc success, connHdl=0x%04X, DescHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].HeartRateMeasurementDescHdl);
        
        if (HRButtonData.notify == 0x0001)
        {
          LOG_INFO_APP("  HEART RATE APPLICATION CLIENT : NOTIFICATION ENABLED\n");
        }
        else
        {
          LOG_INFO_APP("  HEART RATE APPLICATION CLIENT : NOTIFICATION DISABLED\n");
        }
      }
    }
  }
  
  return;
}

/* USER CODE END LF */
